[
"Being a proud supplier of Carhartt® clothing we have a range of different items to select from for both men and women. As always we have great deals on quality products.",

"Home Automotive Apparel Sporting Goods Hardware Get your Gear At The General Store Being a proud supplier of Carhartt® clothing we have a range of different items to select from for both men and women. As always we have great deals on quality products.  1 - 1 < > Monthly Deals Check out all our in store deals this month.  Current Events Check out events we are hosting and participating in.  Current Ads Here is some body text to fill the space for now.  Fishing reports Get your fishing reports for all the great fishing locations.",

"Jon started at The General Store in 2002 after graduating from North Central High School. He started as a hardware sales clerk and stayed there for a few years before being promoted to Warehouse Manager. In 2011 Jon was promoted once again to General Manager. Since he worked his way from the bottom on up he really understands all aspects of the store.",

"The B&L Jewelers General Store on WPBK-FM is hosted by Steven Bullock every Monday-Saturday from 8:30-11:30.",

"Businesses are not allowed to call in items to the show nor are businesses allowed to advertise as a yard sale.  All calls and yard sale items are allowed only at the discretion of WPBK-FM. ",

"Few things in life hit their mark like the Columbia Performance Fishing Gear line. These things come about as close to perfect as you can get without actually catching the fish for you.",

"It's been on your mind. That question you want to ask everyone's favorite aunt. How do you get that spot out of a t-shirt? Or When you make Killed Lettuce and Onions, do you have to use bacon grease? So, go ahead, submit your question to Francine, and she'll answer it. Maybe others have been wondering the same thing. ",

"retail store located usually in a small or rural community that carries a wide variety of goods including groceries but is not divided into departments ",

"a store usually in a small town that sells many different things including groceries",

"We're more than just a gas station and country store. For your convenience, we offer 24-hour automated gas and diesel pumps, along with self-service air and water facilities. A propane tank refill station is also available. Our general store features all your quick-stop necessities, such as delicious fast food, cold beverages and tasty snacks, and basic household items. We have a full liquor and wine selection at competitive prices. We are truly your one-stop convenience center in the north Scottsdale area.",

"The Cafe at Pinnacle Peak is open every day for breakfast and lunch, from 7:00a.m. to 2:00p.m. The menu features home-style American cuisine and our own favorite western specialties. The indoor seating area offers rustic decor and individual dining tables, along with a quaint soda fountain counter. When the weather is nice, we have an outdoor courtyard for your added dining pleasure.",

"There's More: Our antique-filled general store offers unique gifts and southwest souvenirs. The full-service U.S. Post Office Contract Station can handle all of your postal needs from buying stamps to opening a Post Office Mail Box.",

"The Village At Pinnacle Peak is home to many long-time tenants, including an art gallery, a pizza shop, a full-service bank, an insurance agency, various retail shops and boutiques, as well as medical offices. There is almost everything you might need within our lovely complex. Private office space is available for lease.",

"Three bold cuts of meat, including hard salami, capicola and pepperoni, topped with flavorful banana peppers. This is one flavor-packed pizza!"
]

