[
"Being a proud supplier of Carhartt® clothing we have a range of different items to select from for both men and women. As always we have great deals on quality products.",

"Home Automotive Apparel Sporting Goods Hardware Get your Gear At The General Store Being a proud supplier of Carhartt® clothing we have a range of different items to select from for both men and women. As always we have great deals on quality products.  1 - 1 < > Monthly Deals Check out all our in store deals this month.  Current Events Check out events we are hosting and participating in.  Current Ads Here is some body text to fill the space for now.  Fishing reports Get your fishing reports for all the great fishing locations.",

"Jon started at The General Store in 2002 after graduating from North Central High School. He started as a hardware sales clerk and stayed there for a few years before being promoted to Warehouse Manager. In 2011 Jon was promoted once again to General Manager. Since he worked his way from the bottom on up he really understands all aspects of the store.",

"The B&L Jewelers General Store on WPBK-FM is hosted by Steven Bullock every Monday-Saturday from 8:30-11:30.",

"Businesses are not allowed to call in items to the show nor are businesses allowed to advertise as a yard sale.  All calls and yard sale items are allowed only at the discretion of WPBK-FM. ",

"Few things in life hit their mark like the Columbia Performance Fishing Gear line. These things come about as close to perfect as you can get without actually catching the fish for you.",

"It's been on your mind. That question you want to ask everyone's favorite aunt. How do you get that spot out of a t-shirt? Or When you make Killed Lettuce and Onions, do you have to use bacon grease? So, go ahead, submit your question to Francine, and she'll answer it. Maybe others have been wondering the same thing. ",

"retail store located usually in a small or rural community that carries a wide variety of goods including groceries but is not divided into departments ",

"a store usually in a small town that sells many different things including groceries",

"We're more than just a gas station and country store. For your convenience, we offer 24-hour automated gas and diesel pumps, along with self-service air and water facilities. A propane tank refill station is also available. Our general store features all your quick-stop necessities, such as delicious fast food, and tasty snacks, and basic household items. We are truly your one-stop convenience center in the north Scottsdale area.",

"The Cafe at Pinnacle Peak is open every day for breakfast and lunch, from 7:00a.m. to 2:00p.m. The menu features home-style American cuisine and our own favorite western specialties. The indoor seating area offers rustic decor and individual dining tables, along with a quaint soda fountain counter. When the weather is nice, we have an outdoor courtyard for your added dining pleasure.",

"There's More: Our antique-filled general store offers unique gifts and southwest souvenirs. The full-service U.S. Post Office Contract Station can handle all of your postal needs from buying stamps to opening a Post Office Mail Box.",

"The Village At Pinnacle Peak is home to many long-time tenants, including an art gallery, a pizza shop, a full-service bank, an insurance agency, various retail shops and boutiques, as well as medical offices. There is almost everything you might need within our lovely complex. Private office space is available for lease.",

"Three bold cuts of meat, including hard salami, capicola and pepperoni, topped with flavorful banana peppers. This is one flavor-packed pizza!",

"Stick to your knitting here, as the sashimi Napoleon and duck entree are not to be missed. Locals and tourists alike mingle here, cocktails are carefully prepared and desserts are on point as well. Service was a bit lax, but overall a very good experience.",

"Whether it’s post-hike or pre-concert, stop by and enjoy a treat from the Chautauqua General Store, located just west of the Dining Hall.",

"Choose from espresso drinks, teas, chai and cold drinks, baked goods or homemade ice cream and sundaes. Grab-and-go snacks and other supplies like sunscreen, water bottles, hats and basic sundries are also available to equip you for your Chautauqua adventure. To commemorate your visit, don’t forget to browse the selection of old fashioned candies, teas, homemade gifts and Chautauqua merchandise!",

"The Chautauqua General Store is open for the 2018 season!",

"Join us for a Pant-Cake Breakfast tomorrow at #MastStore in #BooneNC. The folks from @Kuhl_USA are fixing pancakes & serving Hatchet Coffee in support of #LandTrustDay. Purchase a pair of Kühl pants, get a hat. Info: http://ow.ly/3IBw30kdC3D",

"The Newtown General Store was built in 1847, as were many mercantile shops of the time. It was a place for town residents to purchase many of the day to day staples needed for everyday life, as well as a place to congregate and discuss many aspects of living in the mid-19th century.",

"Today local residents still come in and talk about life in the early 21st century, but now the Newtown General Store is a full-service delicatessen. It offers many original breakfast, lunch and snack options to satisfy almost any type of appetite. Whether you live locally or are just driving through, stop in and take a step back in time.",

"The family owned and operated Long Sands General Store and Deli is located on scenic Long Sand's Beach in York, Maine. We’ve been serving customers for over 25 years, providing them with all the essentials they will need during a stay on the beach. Whether staying in a motel, cottage, hotel, or just visiting for the day, the Long Sands General Store and Deli has just what you need for your vacation.",


"Within easy walking distance for anyone staying in the Long Sands or Short Sands Beach area, the Long Sands General Store and Deli has all the groceries and goods you will need and also offers a wide selection of Beer and Wine. It’s a great place to start your morning with a cup of Green Mountain Coffee, have lunch with a beach view, grab a quick dinner, or finish your day with a delicious ice cream for desert.",

" real country store experience, our General Store is stocked with everything you’ll need to make your camping, glamping and Lakedale experience more fun! Our new Picnic Pantry has pre-prepped food items to grill on the barbie, sandwiches made fresh every day, along with salads and sweet treats. Start your morning with a piping hot cappuccino or latte and some pancakes from our amazing Pancake Machine. Select from a great array of regional beers and wine, grocery items, makings for S’mores, ice, wood, logo wear and unique souvenir items you just can’t live without (try our Mystical Fire packets to turn your campfire wild shades of blue, green and purple)!",

"The General Store is also the hub of summertime activities at Lakedale. Grab your fishing poles, bait and tackle, rent a canoe, learn to paddle board, and stop by for some ice cream on a hot summer day! Kids love our Activity Center – tie-dying T-shirts (a Lakedale tradition), painting birdhouses, making crazy jewelry and learning to cook over a campfire are all favorites.",

"The General Store is open on weekends starting in May, and 7 days a week from June 15 to Labor Day."

]
