[
"Simply put, we strive to be the best liquor store in Boulder. Serving our customers since 1968, our mission is to provide you with the best selection of beer, wine, and liquor at the lowest possible prices, while maintaining the highest-quality customer experience at both our Boulder, Colorado location and in our online beer, wine, and liquor stores. Visit our store today or shop online and choose from our selection of over 2,000 different beers, 3,000 different varieties of liquor, and nearly 8,000 different wines. See how we can help you find the perfect beverage for any occasion.",

"Please confirm you are above the legal drinking age in your country.",

"You must be of legal drinking age to enter and use this site. To find out more about responsible consumption, visit the Foundation for Advancing Alcohol Responsibility",

"You have reached the best place to buy mini liquor bottles online. We are the worldwide leader in nips, airplaine liquor, mini bottles online! Check out our extensive selection today!",

"Life is full of reasons to celebrate, and Worldwide Wine & Spirit has something for every occasion. Whether you need a full spread of alcohol for a big party or just a couple bottles of wine for relaxing at home, we make it easy for you to buy liquor online. By taking our store online, we are able to offer you much more variety than you’ll find at your local store. We carry both imported and domestic beverages in our online alcohol store so you can find all of your favorite specialty drinks without the hassle of driving around from store to store to find them. With hundreds of brands to choose from, you’ll find all of your favorite wine, beer, spirits and more from all over the world in our online liquor store. Worldwide Wine & Spirits is your passport to a world of good taste! Unsure of what to go with? Not an issue. World Wine & Spirits provides accurate knowledge of tastes and mixture to best fit your taste preference. From our weekly emails and specials to our active industry blog, why go to the store? We give you access to the latest and greatest all at your finger tips! Making the choice to buy alcohol online has never been easier.",

"Worldwide Wine & Spirits is an online liquor store with a wide selection of alcoholic beverages to choose from. We carry everything from exquisite wines, champagne and spirits to specialty beer and gift baskets - all delivered to you at affordable prices. Worldwide Wine & Spirits makes it easier than ever to buy alcohol online, so check out our huge selection today!",

"As one of the premier destinations to buy liquor online, we pride ourselves in the quality of service we offer our customers. We want you to get the most value out of your purchase when you order alcohol online, which is why we are committed to providing you with great products from our online alcohol store at excellent prices. Worldwide Wine & Spirits is also the first liquor store online to offer drive-in pickup. Stop in and see our wonderful store or check out our selection and services online and let us know if you have any questions - our expert staff is available to assist you!",

"Quality Liquor Store offers an expansive selection of craft beers, select wines, quality liquor and specialty spirits. Why fight busy urban traffic? Buy liquor online, or our residential location ensures a hassle-free stop and Quality Liquor Store stocks unique and difficult to find local breweries as well as nationwide specialty beers. Quality Liquor Store is San Diego's number one location for discovering new craft beers, wine, as well as delving into unusual liquors, ensuring your next party or get-together is fun, fresh, and unique.",

"Our highly trained team offers creative suggestions and knowledgeable advice whether you are a wine connoisseur or a weekend warrior. Unable to locate a specialty brew at your local liquor store? Give The Best Liquor Store in San Diego, Quality Liquor Store a chance to impress with thousands of options guaranteed to engage your senses and surpass your expectations. If we don't have it, you don't need it! Don't stock your fridge with tired, generic tasting beverages, treat yourself with our craft beers, quality liquors and wines at affordable prices, all offered with our top-of-the-line service.",

"A list of wine specials of our best cheap wine deals, these great wine buys from all over the world on special closeouts. Purchase these wines for any occasion such wine events, wine dinner parties, table wines or wine gifts! Buy wine online today and have it shipped to your door.",

"Welcome to a Liquor Liquidator e-Store, where you can buy wide selection of liquor and wine we have in stock: virtually every variety of liquor and wine that one can buy online.",

"Info! We ship hard liquor & wine only in MN. We ship wine only (no hard liquor) to the following states: Alaska, California, Idaho, Louisiana, Missouri, Nebraska, Nevada, New Hampshire, New Mexico, North Dakota, Oregon, Virginia, Washington DC, West Virginia, Wyoming. Wine shipping to other states is prohibited by law. ",

"While Champagne and other sparkling wines are commonly uncorked at celebrations, a glass of bubbly can fit any occasion. Liven up your palate by looking through our selections of some of the best sparkling wines.",

"Rosé wine is popular, particularly during the summer months. Its style, traditionally dry and light, appeals both to white and red wine drinkers seeking something cool and refreshing to help beat the heat.",

"A look at the styles of white wines available, vintage pricing and recommendations, producing regions, appropriate food pairing ideas, storing and serving tips. Choosing the right white wine to enjoy with dinner or to serve guests does not have to be hard. ",

"From Cab to Merlot and Shiraz to Pinot, there is plenty to buy and try in the wide world of red wine. Check out our favorites of red wine according to grapes. Take a look at popular red wine varietals, red wine pricing and recommendations, key red wine producing regions, appropriate red wine food pairing ideas.",

"Below is a very basic primer for the most popular types of hard liquor that are currently popular: vodka, whiskies (scotch, Irish, Canadian and bourbon), rum, gin, tequila, and brandy. ",

"The Greenfield Hill Liquor Shop has a great selection of fine wines, liquors, spirits and beer. The staff is friendly and knowledgeable.",

"Since 1950, City Wholesale Liquor Company has served as the one stop shop for Licensed Retail Liquor Dealers in the greater New Orleans area. Selling a full line of liquor, beer, wine and sundry items, we are open seven days a week to serve and support our customers. Orders can be placed in person during regular business hours or 24 hours a day by phone, fax or email. All orders are processed for prompt pick-up at our centrally located facility in New Orleans. Thanks for visiting our site and we hope to see you soon. ",

"Fine wine, specialty spirits, craft beer carefully chosen from all over the world, along with superior customer service, pricing and selection make Tower Beer, Wine & Spirits, Atlanta’s Best Beverage experience.",

"Irwin Greenbaum along with his older brother Leonard wanted to be in the beverage industry and in 1938 after the repeal of prohibition, they got their chance. In 1948 they opened the first Tower Package Store in Atlanta and started building a foundation of excellent service. In 1952 Irwin opened his own Tower Package Store [now Tower Beer, Wine & Spirits] one block from the present location at 2161 Piedmont Rd. At that time, the State of Georgia set prices and all stores sold all items at the same price, so Mr. Greenbaum continued to distinguish his store through superior service. In 1967, the “one price” law changed and Tower become a “discount” store. The discount pricing was so successful that the number of stores rapidly increased and Tower became a name known throughout the State of Georgia.",

"Current owner, Michael Greenbaum followed in his father's footsteps by joined the business in 1969 after completing college. In 1972, Dekalb County passed laws to allow liquor sales, and Tower opened a store one block from the current location at 5877 Buford Highway. Tower took advantage of the increased beer sales in 1970 to surpass nearby competitors. In the 1980s, wine became very popular as the California wines began to become household brands… Tower responded by increasing the wine selection as the United States populous shifted their drinking habits.",

"Tower Beer, Wine & Spirits is widely known for being the leader of volume sales in Georgia. Tower is the best in Scotch Whiskey, Korean, Japanese, Chinese and Hispanic beverages sold and continues to expand product selections to meet customer needs.",

"Success in offering outstanding variety at low prices has created a reputation that truly makes Tower “worth the drive from anywhere.” It is easy to see why Tower has been awarded the “Best of Atlanta” by Atlanta Journal – Constitution, INsite Magazine, FENUXE Magazine and Creative Loafing. Tower has also been recognized as a “Retailer of the Year” by Market Watch Magazine. As the company has grown, the Tower team always remembers it's initial success in the business and exceptional customer service remains the top priority.",

"As the owner of Tower Beer, Wine & Spirits on Buford Highway in Doraville and on Piedmont Road in Buckhead, I wish to share my commitment to you, our customer and to the communities we interact with every day. Our goal is always superior service and for success this must be provided at every level; on the sales floor of our store, with the cashier, and even in the parking lot. If you see me on the floor of the stores, don’t hesitate to say hello. Thanks for shopping at Tower",

" SOHO WINES is an independently owned retail wine and liquor store located in New York City in the heart of SoHo.  Hours of operation are 10 AM to 8 PM, Monday through Saturday.  We offer a wide selection of imported and domestic wines and spirits at competitive prices and we provide Free delivery in Manhattan only  on orders over $100.00--WE DO NOT SHIP--minimum 1 case or equivalent (orders less than 1 case--messenger rates--$12.00 minimum charge).  ALL GIFT DELIVERIES--$12.00 MINIMUM CHARGE!",

"I. DISCOUNTS A. Spirits: While we maintain extremely competitive bottle prices, state regulations allow us to have special promotions. Please inquire.  B. Wines: 1. There is usually a 10% discount on a solid case (12 fifths or equivalent).  2. Special discounts of approximately 17% are given on certain selected items (12 bottles for the price of 10).  3. There is generally an 8.875% discount on any mixed case of 12 bottles of wine.  4. On certain items such as specially priced or rare wines, no further discount is allowed",

"Retail Design for Alcohol (Beers, Wines and Spirits) | Retail Design | Shop Design | Store Design | Retail Fixtures | Retail Shelving | Fixture Design | Commercial Equipment",

"Greetings from me, the Dirt Cheap Chicken! If you didn’t know, Dirt Cheap is your liquor store in St. Louis for cigarettes, tobacco, vapors, beer, wine and liquor!  As you know I want you to have a  “Cheap, Cheap, Fun, Fun” experience whenever you are visiting one of our 12 stores.",

"However, the story of Dirt Cheap is not our story – it is your story. From the beginning, you, our wonderful customers, have told us what to do, and what you wanted. You told us you wanted a large variety of products at very competitive prices while having a fun shopping experience – hence our phrase “Cheap, Cheap, Fun, Fun”! You have made us successful. You have been so very good to us – which is why we say “Thank you! We are grateful for your business – Be careful out there.”",

"Come see us today or find out more about Dirt Cheap by following us on Facebook, learn more about specials, or download our ringtone.  The Best Drinks For Mardi Gras in St. Louis Friends of Fat Tuesday, Laissez les bons temps rouler…sorry, pardon my French. What I meant to say was, let the […]",

"Sale of beer, wine, and liquor by the package for off-premises consumption.  Retail Liquor Stores may sell non-food items related to the consumption of liquor (e.g. soft drinks and mixers; tobacco products; coasters, glasses, stir sticks, etc.) ",

"Stop in and visit our Boutique Bourbon Liquor Shop; browse a huge selection of Kentucky’s native spirit featuring over 120 different brands. Choose one (or a few) to take back as a souvenir to add to your private collection. Our boutique offers a large selection of bourbon foods including bourbon balls, cakes, caramels, and truffles, brittle and other delicious items. The Boutique also carries craft beers, specialty foods, and Kentucky Proud products.",

"A portion of our bourbons include:",

"Liquorland is one of Australia’s largest alcohol stores, stocking a wide range of local and imported wines, beers, ciders, Champagne, spirits and premixed drinks across more than 600 locations nationwide."

]
